app/controllers/bookmarks_controller.rb

SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`user_id` = 1
---
  def index
    @bookmarks = current_user.bookmarks.all

INSERT INTO `bookmarks` (`title`, `link`, `note`, `created_at`, `updated_at`, `user_id`) VALUES ('a', 'b', 'c', '2016-11-02 08:34:18', '2016-11-02 08:34:18', 1)
---
  def create
    @bookmark = Bookmark.new(bookmark_params)

    respond_to do |format|
      if @bookmark.save

DELETE FROM `bookmarks` WHERE `bookmarks`.`id` = 1
---
  def destroy
    @bookmark.destroy

SELECT  `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`user_id` = 3 AND `bookmarks`.`id` = 1 LIMIT 1
---
    def set_bookmark
      @bookmark = current_user.bookmarks.find(params[:id])